<a href="https://colab.research.google.com/github/Hyun-ho-Lee/python/blob/main/pandas%EA%B8%B0%EC%B4%88_%EB%AA%B8%ED%92%80%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [69]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [70]:
s=pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [71]:
dates=pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [72]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.187574  0.143227 -1.411895 -0.114189
2013-01-02  1.120628  0.531526 -1.800785  2.214856
2013-01-03  0.809867 -0.101417  0.821061 -1.308031
2013-01-04 -0.919534  0.230512  0.667064 -0.218169
2013-01-05 -0.018920  0.893741 -1.440536  1.081880
2013-01-06 -0.745143 -0.039159  0.046082  0.848640

In [73]:
list('ABCD')

['A', 'B', 'C', 'D']

In [74]:
df2=pd.DataFrame({'A' : 1.,
                  'B' : pd.Timestamp('20130102'),
                  'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D' : np.array([3] * 4,dtype='int32'),
                  'E' : pd.Categorical(["test","train","test","train"]),
                  'F' : 'foo' })

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [75]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [76]:
def p(): 
  print(df.index)

In [77]:
p()

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [78]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.072412  0.276405 -0.519835  0.417498
std    0.814439  0.376394  1.167158  1.226540
min   -0.919534 -0.101417 -1.800785 -1.308031
25%   -0.563587  0.006437 -1.433376 -0.192174
50%    0.084327  0.186870 -0.682907  0.367225
75%    0.654294  0.456273  0.511818  1.023570
max    1.120628  0.893741  0.821061  2.214856

In [79]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.187574    1.120628    0.809867   -0.919534   -0.018920   -0.745143
B    0.143227    0.531526   -0.101417    0.230512    0.893741   -0.039159
C   -1.411895   -1.800785    0.821061    0.667064   -1.440536    0.046082
D   -0.114189    2.214856   -1.308031   -0.218169    1.081880    0.848640

In [80]:
df['A']

2013-01-01    0.187574
2013-01-02    1.120628
2013-01-03    0.809867
2013-01-04   -0.919534
2013-01-05   -0.018920
2013-01-06   -0.745143
Freq: D, Name: A, dtype: float64

In [81]:
df[0:3]

                   A         B         C         D
2013-01-01  0.187574  0.143227 -1.411895 -0.114189
2013-01-02  1.120628  0.531526 -1.800785  2.214856
2013-01-03  0.809867 -0.101417  0.821061 -1.308031

In [82]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.120628  0.531526 -1.800785  2.214856
2013-01-03  0.809867 -0.101417  0.821061 -1.308031
2013-01-04 -0.919534  0.230512  0.667064 -0.218169

In [83]:
df.loc[dates[0]]

A    0.187574
B    0.143227
C   -1.411895
D   -0.114189
Name: 2013-01-01 00:00:00, dtype: float64

In [84]:
df

                   A         B         C         D
2013-01-01  0.187574  0.143227 -1.411895 -0.114189
2013-01-02  1.120628  0.531526 -1.800785  2.214856
2013-01-03  0.809867 -0.101417  0.821061 -1.308031
2013-01-04 -0.919534  0.230512  0.667064 -0.218169
2013-01-05 -0.018920  0.893741 -1.440536  1.081880
2013-01-06 -0.745143 -0.039159  0.046082  0.848640

In [85]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.187574  0.143227
2013-01-02  1.120628  0.531526
2013-01-03  0.809867 -0.101417
2013-01-04 -0.919534  0.230512
2013-01-05 -0.018920  0.893741
2013-01-06 -0.745143 -0.039159

In [86]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.120628  0.531526
2013-01-03  0.809867 -0.101417
2013-01-04 -0.919534  0.230512

In [87]:
df.iloc[3]

A   -0.919534
B    0.230512
C    0.667064
D   -0.218169
Name: 2013-01-04 00:00:00, dtype: float64

In [88]:
df.iloc[1:3,:] #파이썬에선 1:3 일경우 2행과 3행까지만 출력 (default 0이므로 )

                   A         B         C         D
2013-01-02  1.120628  0.531526 -1.800785  2.214856
2013-01-03  0.809867 -0.101417  0.821061 -1.308031

In [89]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.143227 -1.411895
2013-01-02  0.531526 -1.800785
2013-01-03 -0.101417  0.821061
2013-01-04  0.230512  0.667064
2013-01-05  0.893741 -1.440536
2013-01-06 -0.039159  0.046082

In [90]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.187574  0.143227 -1.411895 -0.114189
2013-01-02  1.120628  0.531526 -1.800785  2.214856
2013-01-03  0.809867 -0.101417  0.821061 -1.308031

In [91]:
df[df>0]

                   A         B         C         D
2013-01-01  0.187574  0.143227       NaN       NaN
2013-01-02  1.120628  0.531526       NaN  2.214856
2013-01-03  0.809867       NaN  0.821061       NaN
2013-01-04       NaN  0.230512  0.667064       NaN
2013-01-05       NaN  0.893741       NaN  1.081880
2013-01-06       NaN       NaN  0.046082  0.848640

In [92]:
df2=df.copy()

In [93]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [94]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.809867 -0.101417  0.821061 -1.308031   two
2013-01-05 -0.018920  0.893741 -1.440536  1.081880  four

In [95]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [96]:
df['F']=s1

In [97]:
df.at[dates[0],'A']=0
df.iat[0,1]=0
df.loc[:,'D']=np.array([5]*len(df))

In [98]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.411895  5  NaN
2013-01-02  1.120628  0.531526 -1.800785  5  1.0
2013-01-03  0.809867 -0.101417  0.821061  5  2.0
2013-01-04 -0.919534  0.230512  0.667064  5  3.0
2013-01-05 -0.018920  0.893741 -1.440536  5  4.0
2013-01-06 -0.745143 -0.039159  0.046082  5  5.0

In [99]:
df2=df.copy()

In [100]:
df2[df2>0]=-df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.411895 -5  NaN
2013-01-02 -1.120628 -0.531526 -1.800785 -5 -1.0
2013-01-03 -0.809867 -0.101417 -0.821061 -5 -2.0
2013-01-04 -0.919534 -0.230512 -0.667064 -5 -3.0
2013-01-05 -0.018920 -0.893741 -1.440536 -5 -4.0
2013-01-06 -0.745143 -0.039159 -0.046082 -5 -5.0

In [102]:
df1=df.reindex(index=dates[0:4],columns=list(df.columns)+['E'])
df1.loc[dates[0]:dates[1],'E']=1

In [105]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.411895  5  NaN  1.0
2013-01-02  1.120628  0.531526 -1.800785  5  1.0  1.0
2013-01-03  0.809867 -0.101417  0.821061  5  2.0  NaN
2013-01-04 -0.919534  0.230512  0.667064  5  3.0  NaN

In [104]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.120628  0.531526 -1.800785  5  1.0  1.0

In [106]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.411895  5  5.0  1.0
2013-01-02  1.120628  0.531526 -1.800785  5  1.0  1.0
2013-01-03  0.809867 -0.101417  0.821061  5  2.0  5.0
2013-01-04 -0.919534  0.230512  0.667064  5  3.0  5.0

In [109]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [110]:
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.190133 -1.101417 -0.178939  4.0  1.0
2013-01-04 -3.919534 -2.769488 -2.332936  2.0  0.0
2013-01-05 -5.018920 -4.106259 -6.440536  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [112]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.411895  5  NaN
2013-01-02  1.120628  0.531526 -1.800785  5  1.0
2013-01-03  0.809867 -0.101417  0.821061  5  2.0
2013-01-04 -0.919534  0.230512  0.667064  5  3.0
2013-01-05 -0.018920  0.893741 -1.440536  5  4.0
2013-01-06 -0.745143 -0.039159  0.046082  5  5.0

In [111]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.411895   5   NaN
2013-01-02  1.120628  0.531526 -3.212680  10   1.0
2013-01-03  1.930495  0.430109 -2.391620  15   3.0
2013-01-04  1.010961  0.660622 -1.724556  20   6.0
2013-01-05  0.992041  1.554363 -3.165092  25  10.0
2013-01-06  0.246899  1.515204 -3.119010  30  15.0

In [113]:
df.apply(lambda x:x.max()-x.min())

A    2.040161
B    0.995158
C    2.621846
D    0.000000
F    4.000000
dtype: float64

In [114]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [115]:
s.value_counts()

5    4
4    2
0    2
6    1
3    1
dtype: int64

In [117]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [118]:
df = pd.DataFrame(
    {
        'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
        'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
        'C' : np.random.randn(8),
        'D' : np.random.randn(8)
    })

In [119]:
df

     A      B         C         D
0  foo    one  1.806373  2.628718
1  bar    one  0.427055 -0.290068
2  foo    two -0.230401 -1.706026
3  bar  three -0.018528  0.857386
4  foo    two  0.307646 -0.644169
5  bar    two -0.017762 -0.174195
6  foo    one -1.807374  0.355676
7  foo  three -0.211931 -0.550761

In [120]:
df.groupby('A').sum()

            C         D
A
bar  0.390765  0.393124
foo -0.135687  0.083437

In [121]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.427055 -0.290068
    three -0.018528  0.857386
    two   -0.017762 -0.174195
foo one   -0.001001  2.984394
    three -0.211931 -0.550761
    two    0.077245 -2.350195